Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.DimensionPlacingAttributes.Distance Property
 The placing distance attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PlacingDistanceAttributes Distance { get; set; }
Public Property Distance As PlacingDistanceAttributes
	Get
	Set
Property Value
Type: PlacingDistanceAttributes
See Also
Reference
DimensionSetBaseAttributes.DimensionPlacingAttributes Class
Tekla.Structures.Drawing Namespace